Revit 2027 API
LeaderStartCondition Enumeration
 An enumerated type listing leader start conditions that are supported for tags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LeaderStartCondition
Public Enumeration LeaderStartCondition
public enum class LeaderStartCondition
type LeaderStartCondition
Members
Member name | Value | Description
Attached | 0 |  Revit automatically keeps the leader start point attached to the tag head.
Free | 1 |  The leader start point can be freely positioned by the user.
Remarks
 The leader start is the point on the leader that is closest to the tag head.
See Also
Reference
Autodesk.Revit.DB Namespace